<?php
// 用while和for循环计算1到100之和

// $a = 1;
// $sum = 0;
// while ($a<=100) {
// 	$sum = $sum + $a;
// 	$a++;
// }

// $i=1;
// $sum=0;
// for (; $i < 101; ) { 
// 	$sum = $sum + $i;
// 	$i++;
// }

// echo $sum;

// 写一个程序打印1到100这些数字，当遇到数字为3的倍数，打印’fizz’ 代替数字，当遇到5的倍数用‘buzz’代替，既是3的倍数又是5的倍数打印‘abcde’.

// for ($i=1; $i <= 100; $i++) {
// 	if ($i%3 == 0) {
// 		// 是3的倍数
// 		if ($i%5 == 0) {
// 			// 是3的倍数和5的倍数
// 			echo 'abcde', '<br>';
// 		} else {
// 			echo 'fizz', '<br>';
// 		}

// 	} else if ($i%5 == 0) {
// 		// 是5的倍数
// 		echo 'buzz', '<br>';
// 	} else {
// 		echo $i, '<br>';
// 	}
// }


// 假设某人有100000现金，每经过一个路口需要进行一次交费，交费规则为当现金大于50000时每次需要交5%，如果现金小于等于50000时，每次交5000，请写一程序计算此人可以经过多少次路口.

$money = 100000;
$guo = 0;

while ($money > 5000) {
	// 缴费
	if ($money > 50000) {
		$money = $money - $money * 0.05;
	} else {
		$money = $money - 5000;
	}
	$guo++;
}

echo '过了', $guo ,'次路口';
