<?php

$arr = ['中', '华', '人', '民'];
print_r($arr);
echo "\r\n";

/*
声明数组时,不指定键,会自动生成,从0开始递增
*/

$arr = [0 =>'中', 3 => '华', '人', '民'];
print_r($arr);
echo "\r\n";

/*
声明数组时,指定某些键,其他没有指定,则没有指定的键,从之前指定的过的最大键开始累加
*/

$arr = ['中', 1=> '华', 2=>'民']; // 0中 1华 2民

$arr = [ 1=> '华', 2=>'民' , '中'];
print_r($arr); // 1华 2民 3中
echo "\r\n";

$arr = ['中', 1 => '华', 0 => '人', '民'];
print_r($arr); // 0人 1华 2民
echo "\r\n";

// 数组打印的顺序
$arr = [1=>'中', 0=>'华', 3=>'人', 2=>'民'];
print_r($arr);

// 打印数组时按照数组声明键的顺序,不是按照键的大小顺序来打印
