<?php

// 从1到500所有自然数中不含数字4的自然数共有多少个？

// 获取数字的每一位
// 156 / 100 = 1.56

// $sum = 0;
// for ($i=1; $i <=500 ; $i++) { 
// 	$bai = floor($i/100);
// 	$shi = floor(($i - $bai * 100) / 10);
// 	$ge = $i - $bai * 100 - $shi * 10;

// 	if ($bai != 4 && $shi != 4 && $ge != 4) {
// 		$sum++;
// 	}
// }
// echo $sum, '<br>';


// 乘法表
// $i被乘数, $j乘数
// for ($i=1; $i <=9 ; $i++) {
// 	for ($j=1; $j <=$i; $j++) { 
// 		echo $i, '*', $j, '=', $i*$j, '&nbsp;&nbsp;';
// 	}
// 	echo '<br>';
// }

// 金字塔
$row = 6;
for ($i=1; $i <= $row; $i++) {
	// $i行数
	for ($j=1; $j <= $row-$i; $j++) { //打空格
		echo '&nbsp;';
	}
	// 2*$i-1
	for ($x=1; $x <= 2*$i-1; $x++) { 
		echo '*';
	}
	// for ($j=1; $j <= $i; $j++) { 
	// 	echo '*';
	// }
	echo '<br>';
}








